Repository: openlab/DataLab
Catalog: DataBrowser/DataBrowser.WebRole/Resources/Views/Developers/Index.*.resx
Languages: fr

# OGDICanAlsoReturnDataInTheRDF
source: OGDI DataLab can also return data in the <a href="http://en.wikipedia.org/wiki/Resource_Description_Framework" target="_blank">RDF (Resource Description Framework)</a><img src="/Images/ExternalLink.png" longdesc="/Descriptions/Json.txt" /> format. RDF is a graph model for describing formally web resources and their associated metadata. Developed by W3C, RDF is a base language for semantic Web. To return data in RDF format, simply append the format=rdf parameter to your query:
fr: Le service de données d’OGDI DataLab peut aussi retourner les données au format <a href="http://fr.wikipedia.org/wiki/Resource_Description_Framework" target="_blank">RDF (Resource Description Framework)</a><img src="/Images/ExternalLink.png" longdesc="/Descriptions/Json.txt" />. RDF est un modèle de graphe qui permet de décrire de façon formelle des ressources web et leur métadonnées associées. Développé par le W3C, RDF est le langage de base du Web sémantique. Pour retourner des données au format RDF, il suffit d’ajouter format=rdf à votre requête. Par exemple, pour retourner les points d’apport volontaire des déchets ménagers en verre pour la métropole de rennes au format RDF :

# OGDIDemoURLFormat
source: <blockquote> http://ogdi.cloudapp.net/v1/dc/CrimeIncidents?$filter=shift eq 'EVN'&format={0}</blockquote>
fr: <a href="http://ogdifrancedataservice.cloudapp.net/v1/frOpenData/RennesPAV/?$filter=flux eq 'VE' &format={0}"> http://ogdifrancedataservice.cloudapp.net/v1/frOpenData/RennesPAV/?$filter=flux eq 'VE' &format={0}</a>
