Repository: openlab/DataLab
Catalog: DataBrowser/DataBrowser.WebRole/Resources/Views/Developers/Index.*.resx
Languages: fr

# AlsoNoteThatIfAPropertyHasANullValue
source: Also note that if a property has a null value for a particular entity in the data set, it will be omitted entirely from the result set returned by OGDI DataLab. For example, in the Crime Incidents data set, the "method" property is only returned for records that have a "method" value in the underlying data set. Your application design should take this into account and handle potentially missing properties.
fr: A noter que si une propriété d'un ensemble de données a une valeur nulle, elle sera inexistante dans le résultat retourné par le service de données d’OGDI DataLab. Par exemple, si dans un ensemble de données vous avez la propriété ville et arrondissement et que votre requête ne retourne que des villes sans arrondissement, le champ arrondissement ne sera pas retourné. Votre application doit prendre en compte la possible absence d'un champ dans le résultat retourné.

# ByDefaultOGDIReturnsDataInTheAtomPub
source: By default, OGDI DataLab returns data in the <a href="http://odata.org/" target="_blank">Open Data Protocol (OData)</a><img src="/Images/ExternalLink.png" alt="Open Data Protocol (OData)" longdesc="/Descriptions/AtomPBExt.txt" /> format. This format extends the broadly adopted <a href="http://bitworking.org/projects/atom/rfc5023.html" target="_blank">Atom Publishing Protocol</a><img src="/Images/ExternalLink.png" alt="Click to get Atom Publishing Protocol" title="Atom Publishing Protocol" longdesc="/Descriptions/AtomPB.tx" /> and can be easily consumed by a variety of platforms, including Microsoft .NET, Java, Ruby, PHP, and Python. Refer to the code samples on the <a href="/DataBrowser/dc/CrimeIncidents#param=NOFILTER--DataView--Results">Data Browser</a> page for examples.
fr: Par défaut, OGDI DataLab retourne les données dans le format du <a href="http://odata.org/" target="_blank">protocole Odata (Open Data Protocol)</a><img src="/Images/ExternalLink.png" alt="Open Data Protocol (OData)" longdesc="/Descriptions/AtomPBExt.txt" />. Ce format étend le protocole largement utilisé <a href="http://tools.ietf.org/html/rfc5023" target="_blank">Atom Pub</a><img src="/Images/ExternalLink.png" alt="Click to get Atom Publishing Protocol" title="Atom Publishing Protocol" longdesc="/Descriptions/AtomPB.tx" /> et peut être utilisé par une variété de plateformes incluant .NET, Java, Ruby, PHP et Python. Différents exemples de code sont proposés sur la page de <a href="/DataBrowser/frOpenData/RennesPAV#param=NOFILTER--DataView--Results">visualisation des données</a>.

source: Client Libraries
fr: Bibliothèques clientes

# ContainerIsTheNameOfTheContainer
source: <i>container</i> is the name of the container (for example, "dc" for the District of Columbia's data sets).
fr: <b><i>container</i></b> est le nom du conteneur (par exemple, "frOpenData" pour les ensembles de données mis à disposition par l’entrepôt de données) ;

source: Data Formats
fr: Format de données

# DatasetIsTheNameOfTheDataSet
source: <i>dataset</i> is the name of the data set (for example, "CrimeIncidents" for the Crime Incidents data set in the DC container).
fr: <b><i>dataset</i></b> est le nom de l'ensemble de données (par exemple, "RennesPAV" vis-à-vis de l'ensemble des données localisant les points d'apport volontaire (PAV) des déchets ménagers mis à disposition par le <a href="http://www.data.rennes-metropole.fr/les-donnees/catalogue/?tx_icsopendatastore_pi1%5buid%5d=47" target="_blank">Service SIG Rennes Métropole</a> <img src="/Images/ExternalLink.png" alt="Service SIG Rennes Métropole" title="Service SIG Rennes Métropole" longdesc="/Descriptions/REST.txt" /> ) ;

# DevelopersUsingVisualStudio2010
source: Developers using <a href="http://www.microsoft.com/vstudio" target="_blank">Microsoft Visual Studio 2010</a><img src="/Images/ExternalLink.png" alt="Click to get Microsoft Visual Studio 2010" title="Microsoft Visual Studio 2010" longdesc="/Descriptions/VS2010.txt" /> (or later) can use <a href="http://msdn.microsoft.com/en-us/data/bb931106.aspx" target="_blank">WCF Data Services</a><img src="/Images/ExternalLink.png" alt="Click to get WCF Data Services" title="WCF Data Services" longdesc="/Descriptions/ADOServices.txt" /> to access data from OGDI through easy-to-use .NET classes. Within Visual Studio, this is accomplished by using the <a href="http://msdn.microsoft.com/en-us/data/cc974504.aspx" target="_blank">Add Service Reference</a><img src="/Images/ExternalLink.png" alt="A video showing how to consume ADO.NET Data Service in a .NET Application" longdesc="/Descriptions/AddSvcRef.txt" /> feature (see .NET samples on the <a href="/DataBrowser/dc/CrimeIncidents#param=NOFILTER--DataView--Results"> Data Browser</a> page). To make accessing OGDI data easier, Java developers can use <a href="http://www.interoperabilitybridges.com/projects/restlet-extension-for-adonet-data-services.aspx" target="_blank">Restlet Extension for WCF Data Services</a><img src="/Images/ExternalLink.png" alt="Restlet Extension for WCF Data Services" longdesc="/Descriptions/JavaLib.txt" />. PHP developers can take advantage of the Toolkit for <a href="http://www.interoperabilitybridges.com/projects/toolkit-for-php-with-adonet-data-services-.aspx" target="_blank">Toolkit for PHP with WCF Data Services</a><img src="/Images/ExternalLink.png" alt="Toolkit for PHP with WCF Data Services" longdesc="/Descriptions/PHPLib.txt" />.
fr: Les développeurs utilisant <a href="http://www.microsoft.com/france/visualstudio/" target="_blank"> Microsoft Visual Studio 2010</a><img src="/Images/ExternalLink.png" alt="Click to get Microsoft Visual Studio 2010" title="Microsoft Visual Studio 2010" longdesc="/Descriptions/VS2010.txt" /> peuvent utiliser WCF Data Services pour accéder aux données ainsi exposées via des classes .NET. Avec Visual Studio, cela s’effectue simplement au travers de la fonctionnalité <a href="http://msdn.microsoft.com/en-us/data/cc974504.aspx" target="_blank">Add Service Reference</a> <img src="/Images/ExternalLink.png" alt="Click for Add Service Reference" longdesc="/Descriptions/AddSvcRef.txt" />(Ajouter une référence à un service) (voir les exemples avec le Microsoft Framework.NET sur la page de <a href="/DataBrowser/frOpenData/RennesPAV#param=NOFILTER--DataView--Results"> visualisation des donées</a>). Les interfaces de programmation Web proposées par le Kit de démarrage OGDI sont accessibles à une grande variété de technologies client. Ainsi, par exemple, les développeurs Java peuvent utiliser la bibliothèque <a href="http://www.restlet.org/downloads/" target="_blank">Restlet Extension for OData</a><img src="/Images/ExternalLink.png" alt="Restlet Extension for WCF Data Services" longdesc="/Descriptions/JavaLib.txt" />, une composante du projet Open Source Restlet mettant à disposition un Framework léger REST pour Java. Les développeurs PHP peuvent tirer parti du kit de développement logiciel <a href="http://odataphp.codeplex.com/" target="_blank">OData pour PHP</a> <img src="/Images/ExternalLink.png" alt="Toolkit for PHP with WCF Data Services" longdesc="/Descriptions/PHPLib.txt" />.

source: For Developers
fr: Pour les développeurs

source: Geospatial Data
fr: Données géospaciales

# ManyOfTheDataSetsInOGDI
source: Many of the data sets in OGDI DataLab also include geospatial data, which is returned in the <a href="http://en.wikipedia.org/wiki/Keyhole_Markup_Language" target="_blank"> Keyhole Markup Language (KML)</a><img src="/Images/ExternalLink.png" alt="Click to get Keyhole Markup Language" title="Keyhole Markup Language (KML)" longdesc="/Descriptions/KML.txt" /> format. This format is compatible with popular desktop and Web-based mapping technologies including Microsoft <a href="http://dev.live.com/virtualearth" target="_blank">Bing Maps</a><img src="/Images/ExternalLink.png" alt="Click to get Bing Maps" title="Bing Maps" longdesc="/Descriptions/VE.txt" />, <a href="http://maps.google.com" target="_blank"> Google Maps</a><img src="/Images/ExternalLink.png" alt="Click to get Google Maps" title="Google Maps" longdesc="/Descriptions/GoogleMap.txt" />, <a href="http://maps.yahoo.com" target="_blank"> Yahoo! Maps</a><img src="/Images/ExternalLink.png" alt="Click to get Yahoo! Maps" title="Yahoo! Maps" longdesc="/Descriptions/YahooMaps.txt" />, and <a href="http://earth.google.com" target="_blank"> Google Earth</a><img src="/Images/ExternalLink.png" alt="Click to get Google Earth" title="Google Earth" longdesc="/Descriptions/GoogleEarth.txt" />.
fr: La plupart des ensembles de données ainsi proposés est susceptible d’inclure également des données géo spatiales, qui peuvent être alors retournées dans le format <a href="http://fr.wikipedia.org/wiki/Keyhole_Markup_Language" target="_blank"> KML (Keyhole Markup Language)</a><img src="/Images/ExternalLink.png" alt="Click to get Keyhole Markup Language" title="Keyhole Markup Language (KML)" longdesc="/Descriptions/KML.txt" /> ,rendant le Kit de démarrage OGDI compatible avec des technologies de cartographie sur poste de travail ou sur le Web, comme <a href="http://www.geoportail.fr/" target="_blank"> Géoportail</a><img src="/Images/ExternalLink.png" alt="Click to get Géoportail" title="Google Earth" longdesc="/Descriptions/GoogleEarth.txt" />, <a href="http://earth.google.com" target="_blank"> Google Earth</a><img src="/Images/ExternalLink.png" alt="Click to get Google Earth" title="Google Earth" longdesc="/Descriptions/GoogleEarth.txt" />, <a href="http://maps.google.com" target="_blank"> Google Maps</a><img src="/Images/ExternalLink.png" alt="Click to get Google Maps" title="Google Maps" longdesc="/Descriptions/GoogleMap.txt" />, <a href="http://www.bing.com/maps/" target="_blank"> Microsoft Bing Maps</a><img src="/Images/ExternalLink.png" alt="Click to get Bing Maps" title="Bing Maps" longdesc="/Descriptions/VE.txt" /> ou encore <a href="http://maps.yahoo.com" target="_blank"> Yahoo! Maps</a><img src="/Images/ExternalLink.png" alt="Click to get Yahoo! Maps" title="Yahoo! Maps" longdesc="/Descriptions/YahooMaps.txt" />.

# NoteThatIfTheDataSet
source: Note that if the data set that you are using does not include any geospatial data, a KML query to OGDI DataLab will return an empty result set.
fr: A noter que Si l'ensemble de données ne contient pas de données de géolocalisation, une requête de type KML au service de données OGDI DataLab retournera un résultat vide.

# NoteThatOGDICurrentlyOnlySupportsThe
source: Note that OGDI DataLab currently only supports the $filter and $top query options in the WCF Data Services query syntax.
fr: A noter que le kit de démarrage OGDI DataLab ne supporte actuellement que les options de requête de WCF Data Services $filter et $stop. Des requêtes exemples utilisant l'ensemble des données "RennesPAV" sont disponibles sur la page <a href="/Databrowser/frOpenData/RennesPAV">visualisation des données</a> du kit de développement logiciel (SDK).

# OGDIAndTheUnderlyingWindowsAzureTableStorageService
source: OGDI DataLab and the underlying Windows Azure Table Storage service support paging through large sets of query results. The documentation for <a href="http://msdn.microsoft.com/en-us/library/dd135718.aspx" target="_blank">Query Timeout and Pagination</a><img src="/Images/ExternalLink.png" alt="Click to get Query Timeout and Pagination" title="Query Timeout and Pagination" longdesc="/Descriptions/QueryTimeoutPagination.txt" /> in the Windows Azure Table Storage service provides a complete description of how OGDI and the underlying Azure platform support paging. You can also refer to the "C#/ASP.NET Paging" sample on the <a href="/DataBrowser/dc/CrimeIncidents#param=NOFILTER--DataView--Results"> Data Browser</a> page, which demonstrates how to perform paged queries using the WCF Data Services client library.
fr: Le service de données OGDI DataLab et le service sous-jacent de tables Windows Azure supportent la pagination pour les résultats d'un volume important. L’article MSDN <a href="http://msdn.microsoft.com/en-us/library/dd135718.aspx" target="_blank">Query Timeout et la Pagination</a> <img src="/Images/ExternalLink.png" alt="Click to get Query Timeout and Pagination" title="Query Timeout and Pagination" longdesc="/Descriptions/QueryTimeoutPagination.txt" /> de la documentation Windows Azure une description complète sur la façon dont OGDI et la plateforme Windows Azure prennent en charge la pagination. Vous pouvez vous référer également au code exemple "Pagination C#/ASP.NET " sur la page de <a href="/DataBrowser/frOpenData/RennesPAV#param=NOFILTER--DataView--Results"> visualisation des données</a>, qui illustre comment gérer la pagination en utilisant la bibliothèque cliente <a href="http://msdn.microsoft.com/fr-fr/data/bb931106.aspx" target="_blank">WCF Data Services.</a><img src="/Images/ExternalLink.png" alt="Click to get WCF Data Services" title="WCF Data Services" longdesc="/Descriptions/QueryTimeoutPagination.txt" />

# OGDICanAlsoReturnDataInTheJSON
source: OGDI Lab can also return data in the <a href="http://en.wikipedia.org/wiki/JSON" target="_blank">JavaScript Object Notation (JSON)</a><img src="/Images/ExternalLink.png" alt="Click to get JavaScript Object Notation" title="JavaScript Object Notation (JSON)" longdesc="/Descriptions/Json.txt" /> format, which can be conveniently consumed using JavaScript and other technologies. To return data in JSON format, simply append the format=json parameter to your query. For example, to retrieve crime incidents in Washington, DC that occurred during the police department's evening shift in JSON format:
fr: Le service de données d’OGDI DataLab peut aussi retourner les données au format <a href="http://fr.wikipedia.org/wiki/JSON" target="_blank">JSON (JavaScript Object Notation)</a><img src="/Images/ExternalLink.png" alt="Click to get JavaScript Object Notation" title="JavaScript Object Notation (JSON)" longdesc="/Descriptions/Json.txt" /> qui peut être plus facilement exploitable depuis JavaScript ou autre technologie. Pour retourner des données au format JSON, il suffit d'ajouter format=json à votre requête. Par exemple, pour retourner les points d'apport volontaire des déchets ménagers en verre pour la métropole de Rennes au format JSON :

# OGDIDataServicesAlsoProvideDirectSupportForTheJSONP
source: OGDI DataLab's data services also provide direct support for the <a href="http://en.wikipedia.org/wiki/JSON#JSONP" target="_blank">JSONP</a><img src="/Images/ExternalLink.png" alt="Click to get JSONP" title="JSONP" longdesc="/Descriptions/JSONP.txt" /> technique. Using this technique, OGDI's data services will call a callback function that you specify, passing in the results of your query in JSON format as an input format. To use this technique, issue a query with the following additional parameters: format=json&callback=<i>yourCallback</i>, where <i>yourCallback</i> is the name of a JavaScript callback function defined on the Web page issuing the request.
fr: OGDI DataLab fournit un support direct pour la technique <a href="http://fr.wikipedia.org/wiki/JSON#JSONP" target="_blank">JSONP</a><img src="/Images/ExternalLink.png" alt="Click to get JSONP" title="JSONP" longdesc="/Descriptions/JSONP.txt" />. En utilisant cette technique, le service de données OGDI DataLab appelle la fonction de rappel (callback) que vous aurez spécifiée, passant le résultat de votre requête au format JSON comme format d'entrée. Pour utiliser cette technique, il convient de construire votre requête avec les paramètres additionnels <i>format=json&callback=<callback></i> où <i><callback></i> est le nom de votre fonction de rappel JavaScript définie dans la page émettant la requête.

# OGDIExposesDataThrough
source: OGDI DataLab exposes data through <a href="http://en.wikipedia.org/wiki/Representational_State_Transfer" target="_blank"> REST</a><img src="/Images/ExternalLink.png" alt="Click to get REST article on the Wikipedia" title="REST" longdesc="/Descriptions/REST.txt" /> Web services. The basic format of an OGDI service call is http://ogdi.cloudapp.net/v1/<i>container</i>/<i>dataset</i>?<i>query</i>, where:
fr: Le kit de démarrage OGDI DataLab utilise et expose des services Web <a href="http://en.wikipedia.org/wiki/Representational_State_Transfer" target="_blank"> RESTful</a><img src="/Images/ExternalLink.png" alt="Click to get REST article on the Wikipedia" title="REST" longdesc="/Descriptions/REST.txt" />, en l’occurrence, des services Web implémentés à l'aide du protocole http et des principes REST, pour exposer des données pour la programmation. Le format de base des URLs pour invoquer un service du kit est la suivante: http://<b><i>[project]</i></b>.cloudapp.net/v1/<b><i>[container]</i></b>/<b><i>[dataset]</i></b>?<b><i>[query]</i></b> où:

source: Paging
fr: A propos de la pagination

# QueryingOGDI
source: Querying OGDI DataLab
fr: Requêter OGDI DataLab

# QueryIsYourSetOfQueryParameters
source: <i>query</i> is your set of query parameters, expressed using a subset of the <a href="http://msdn.microsoft.com/en-us/library/cc668784(VS.100).aspx" target="_blank">WCF Data Services query syntax.</a><img src="/Images/ExternalLink.png" alt="Click to get WCF Data Services query syntax" title="WCF Data Services query syntax" longdesc="/Descriptions/ADOquerysyntax.txt" />
fr: <b><i>query</i></b> est l’ensemble des paramètres de la requête, exprimé en utilisant un sous ensemble de la <a href="http://msdn.microsoft.com/fr-fr/library/dd673933.aspx" target="_blank">syntaxe de requête de WCF Data Services.</a><img src="/Images/ExternalLink.png" alt="Click to get WCF Data Services query syntax" title="WCF Data Services query syntax" longdesc="/Descriptions/ADOquerysyntax.txt" />

# ReferToTheJavaScriptSampleOnThe
source: Refer to the JavaScript sample on the <a href="/DataBrowser/dc/CrimeIncidents#param=NOFILTER--DataView--Results"> Data Browser</a> page for an example of using JSONP with OGDI DataLab. In that sample, the AdditionalDataLoaded() function is the JSONP callback function.
fr: Vous pouvez consulter l'exemple de code JavaScript sur la page <a href="/DataBrowser/frOpenData/RennesPAV#param=NOFILTER--DataView--Results">visualisation des données</a> pour un exemple utilisant JSONP avec OGDI. Dans cet exemple, la fonction AdditionalDataLoaded() est la fonction de callback JSONP.

# TheOpenGovernmentDataInitiativeIsBased
source: OGDI DataLab is written using C# and the .NET Framework, targeted for Microsoft's <a href="http://www.windowsazure.com/">Windows Azure Platform</a> cloud-computing platform. Data Service.<br /><br /> The DataService uses RESTful Web service to expose data for programmatic access via a number of formats, including Open Data Protocol (OData)**, an extension to **Atom Publishing Protocol (AtomPub), Keyhole Markup Language (KML), JSON and JSONP.<br /><br /> The Data Browser is written an ASP.NET MVC 3.0 and uses jQuery and a variety of other open source components and enables users to browse and query published data.<br /><br /> The Data Loader is desktop client tool that includes both GUI-based and console-based data loader tools.
fr: OGDI DataLab repose sur la plateforme Windows Azure, l’offre Platform as a Service (PaaS) de Microsoft, un environnement d’exécution et d’hébergement ouvert qui aide les développeurs à rapidement et facilement créer, déployer, gérer et exécuter des applications et services Web à l'échelle de l'internet. La plateforme Windows Azure permet ainsi aux développeurs de se concentrer sur leur cœur de métier : les applications et les services Web. Les développeurs utilisent leurs compétences existantes (.NET, Ruby, Python, Java, PHP, etc.) et leurs outils actuels (Visual Studio, Eclipse, etc.) pour développer ces applications et services Web et les déployer dans le Cloud. Pour en savoir plus, n'hésitez pas à aller sur la page d’accueil de la <a href="http://www.microsoft.com/france/windows-azure/" target="_blank"> plateforme Windows Azure.</a><img src="/Images/ExternalLink.png" alt="Click to get Azure Services Platform home page" title="Azure Services Platform" longdesc="/Descriptions/Home.txt" />

# TheWindowsAzurePlatform
source: Overview
fr: Plateforme Windows Azure

# ToMitigateSecurityVulnerabilities
source: To mitigate security vulnerabilities associated with cross-site scripting attacks, Web browsers generally prevent client-side JavaScript applications originating in one network domain (for example, yourdomain.com) from making HTTP requests to other network domains (for example, the ogdi.cloudapp.net network domain that hosts the OGDI DataLab data services). This can prevent JavaScript applications hosted in another domain from making straight-forward calls to the OGDI DataLab data services, but there a variety of techniques that can be used, such as this widely-used <a href="http://softwareas.com/cross-domain-communication-with-iframes" target="_blank">IFRAMES-based technique</a><img src="/Images/ExternalLink.png" alt="Click to get IFRAMES-based technique" title="IFRAMES-based technique" longdesc="/Descriptions/IFRAMES.txt" /> described by Michael Mahemoff.
fr: Pour diminuer la vulnérabilité en terme de sécurité liée aux attaques de type scriptage intersite (cross-site scripting ou XSS en abrégé), généralement les navigateurs empêchent le JavaScript d'une page Web venant d'un domaine X de faire des requêtes http vers un autre domaine Y. Cela empêche tout code JavaScript hébergé sur un domaine de faire des appels directs au service de données OGDI DataLab, mais il existe plusieurs techniques qui peuvent être utilisées comme la <a href="http://softwareas.com/cross-domain-communication-with-iframes" target="_blank">technique fondée sur des IFrames.</a> <img src="/Images/ExternalLink.png" alt="Click to get IFRAMES-based technique" title="IFRAMES-based technique" longdesc="/Descriptions/IFRAMES.txt" />

# ToReturnGeospatialDataInKMLFormat
source: To return geospatial data in KML format, append the format=kml parameter to your query. For example, to retrieve geospatial points in KML format for crime incidents in DC that occurred during the police department's evening shift:
fr: Pour retourner des données géo-spatiales au format KML, il suffit de rajouter <i>format=kml</i> à la requête. Par exemple, pour retourner les points d'apport volontaire des déchets ménagers en verre pour la métropole de Rennes au format KML :

# ProjectEstLeNomDuProjet
source: <project> is the name of the service project for the publication service based on the OGDI DataLab starter kit in Windows Azure ("ogdifrancedataservice" for example)
fr: <b><i>project</i></b> est le nom de projet de service pour la publication du service fondé sur le Kit de démarrage OGDI DataLab dans Windows Azure (par exemple "ogdifrancedataservice") ;
