Repository: openlab/DataLab
Catalog: DataBrowser/DataBrowser.WebRole/Resources/Views/DataBrowser/DataSetData.*.resx
Languages: fr

source: Aggregate
fr: Agréger

source: Average
fr: Moyenne

source: Bar Chart
fr: Graphique en colonnes

source: (Click to view results as XML/KML)
fr: (Cliquer pour voir les résultats au format XML/KML)

# CrimeIncidentsWhereTheMethodCode
source: Crime incidents where the method code is equal to 2. Other comparison operators include &quot;gt&quot; for greater than, &quot;lt&quot; for less than, &quot;ge&quot; for greater than or equal to, and &quot;le&quot; for less than or equal to.
fr: Incidents criminels où le code de la méthode est égal à 2. les autres opérateurs de comparaison incluent &quot;gt&quot; pour plus grand que, &quot;lt&quot; pour moins que, &quot;ge&quot; pour plus grand que ou égal à, et &quot;le&quot; pour moins que ou égal à.

# CrimeIncidentsWhereTheReportDatetime
source: Crime incidents where the report date/time is on or after midnight, June 1, 2008, UTC. Date/time literals are expressed in <a href="http://en.wikipedia.org/wiki/ISO_8601" target="_blank">ISO 8601</a><img src="/Images/ExternalLink.png" alt="DBPC_ISO8601AltText" title="ISO 8601" longdesc="/Descriptions/Iso.txt" /> format, <i>yyyy</i>-<i>mm</i>-<i>dd</i>T<i>HH</i>:<i>MM</i>:<i>SS</i>, where <i>yyyy</i> is the four-digit year, <i>mm</i> is the two-digit month number, <i>dd</i> is the two-digit day of the month, <i>HH</i> is the two-digit hour (in 24-hour format), <i>MM</i> is the two-digit minute, and <i>SS</i> is the two-digit second.
fr: Incidents criminels dont la date/heure du rapport est à ou après minuit, 1er Juin 2008 UTC. Les dates/heures sont exprimées dans le format <a href="http://en.wikipedia.org/wiki/ISO_8601" target="_blank">ISO 8601</a> <img src="/Images/ExternalLink.png" alt="Click to get ISO 8601" title="ISO 8601" longdesc="/Descriptions/Iso.txt" />, <i>yyyy</i>-<i>mm</i>-<i>dd</i>T<i>HH</i>:<i>MM</i>:<i>SS</i>, où <i>yyyy</i> est l'année sur 4 digits, <i>mm</i> est le numéro du mois sur 2 digits, <i>dd</i> est le jour du mois sur 2 digits, <i>HH</i> est l'heure sur 2 digits (dans le format 24H), <i>MM</i> représente les minutes, et <i>SS</i> les secondes.

# CrimeIncidentsWhereTheShiftIsEqualTo
source: Crime incidents where the shift is equal to &quot;EVN;&quot; or &quot;MID&quot;. The filter syntax supports the &quot;and&quot;, &quot;or&quot;, and &quot;not&quot; logical operators. Expressions can grouped with parentheses, as in many popular programming languages.
fr: Incidents criminels où le &quot;shift&quot; est égal à &quot;EVN;&quot; ou &quot;MID&quot;. La syntaxe de filtrage supporte les opérateurs logiques &quot;and&quot;, &quot;or&quot;, and &quot;not&quot; Les expressions peuvent être groupées avec des parenthèses, comme dans de nombreux langages de programmation.

# CrimeIncidentsWhereTheShiftProperty
source: Crime incidents where the &quot;shift&quot; property is equal to &quot;EVN&quot;. String literals must be enclosed in single quotes. Boolean literals are represented as &quot;true&quot; or &quot;false&quot; (without the double quotes).
fr: Incidents criminels où la propriété &quot;shift&quot; est égale à &quot;EVN&quot;. Les chaines de caractères doivent être entourées par des guillemets simples. Les booléens sont représentées par les chaines de caractères &quot;true&quot; ou &quot;false&quot; (sans les guillemets doubles).

source: Data View
fr: Vue données

# EntitysetColumn
source: Entityset<br />Column:&nbsp;&nbsp;
fr: Colonne<br /> des valeurs:&nbsp;&nbsp;

source: Full query URL:
fr: URL de la requête complète :

source: Horizontal Axis
fr: Axe horizontal

source: Map View
fr: Vue carte

source: No. of occurrences of
fr: Nb d'occurrences de

# NumberOfPlacemarksInAResultSetExceedsThePinDisplayCountLimit
source: Number of placemarks in a result set exceeds the pin display count limit (50 placemarks)
fr: Nombre d'emplacements dans le résultat excède la limite d'affichage du nombre de points (50 emplacements)

# OGDIUsesASubsetOf
source: OGDI uses a subset of the <a href="http://msdn.microsoft.com/en-us/library/cc668784(VS.100).aspx"> WCF Data Services query syntax</a><img src='/Images/ExternalLink.png' alt='Click to get WCF Data Services query syntax' title='WCF Data Services query syntax' longdesc='/Descriptions/ADOquerysyntax.txt' />. The basic format of a filter expression is <i>property</i>&nbsp;<i>comparison</i>&nbsp;<i>expression</i>, where <i>property</i> is the name of a property, <i>comparison</i> is a comparison operator, and <i>expression</i> is the expression with which the property&#39;s value should be compared.
fr: OGDI utilise un sous-ensemble de <a href="http://msdn.microsoft.com/en-us/library/cc668784(VS.100).aspx"> la syntaxe de requête de WCF Data Services</a> <img src='/Images/ExternalLink.png' alt='Click to get WCF Data Services query syntax' title='WCF Data Services query syntax' longdesc='/Descriptions/ADOquerysyntax.txt' />. Le format basique d'une expression de filtrage est <i>propriété</i>&nbsp;<i>comparaison</i>&nbsp;<i>expression</i>, où <i>propriété</i> est le nom de la propriété, <i>comparaison</i> est l'opérateur de comparaison, et <i>expression</i> est l'expression à laquelle la valeur de la propriété est comparée.

source: Pie Chart
fr: Graphique en camembert

source: Please select valid column from list.
fr: Veuillez sélectionner une colonne valide depuis la liste.

source: Range:
fr: Etendue:

source: Selected data does not have location information.
fr: La donnée sélectionnée n'a pas d'information de localisation.

source: (Select one)
fr: (Sélectionner...)

# SomeExamplesOfFilterExpressions
source: Some examples of filter expressions using the CrimeIncidents data set from the DC container are:
fr: Quelques exemples d'expressions de filtrage utilisant les données de CrimeIncidents du conteneur DC:

source: Vertical Axis
fr: Axe vertical

source: (additional $filter parameters...)
fr: (paramètres $filter additionnels...)

source: refresh-chart
fr: refresh-chart-fr
